# Напишите функцию, которая возвращает минимальное из
# пяти чисел. Числа передаются в качестве параметров.

def min_num(a,b,c,d,e):
    return print(min(a,b,c,d,e))

a= int(input("Введите первое число"))
b= int(input("Введите второе число"))
c= int(input("Введите третье число"))
d= int(input("Введите четвертое число"))
e= int(input("Введите пятое число"))
min_num(a,b,c,d,e)